package skillklan.module1.theme3;

public class Practice {
    public static void main(String[] args) {
        int i = 2;
        do {
            System.out.println("HI");
        }
        while (i < 2);
    }
}
//        int i = 0;
//        while (i <= 20) {
//            if (i % 2 == 0){
//                System.out.println(i);
//            }
//            i++;
//        }
//    }
//}
//        int i = 2;
//        while (i <= 10) {
//            System.out.println(i);
//            i = i + 2;
//        }
//    }
//}

//        int a = 5;
//        int b = 2;
//        System.out.println(a/b);
//        System.out.println(5.0/2);

//String[] names = {"Ben", "Alex", "Dan"};
//
//        for (int i = 0; i < names.length; i++) {
//        System.out.println(names[i]);
//        }


//        int[] ids = {1, 2, 13, 14, 15, 3, 10, 11, 12, 4, 5, 6, 7, 8, 9};
//        int inputId = 20;
//
//        boolean valExist = false;
//        for (int id : ids) {
//            if (inputId == id) {
//                valExist = true;
//                break;
//            }
//        }
//        System.out.println(valExist);
//    }
//}
//        int[] ids = {1, 2, 13, 14, 15, 3, 10, 11, 12, 4, 5, 6, 7, 8, 9};
//        int inputId = 3;
//        boolean valExist = false;
//        for (int id : ids) {
//            if (inputId == id) {
//                return true;
//            }
//        }
//        return false;
//    }
//}
//        printSum(5, 7);
//    }
//
//    static void printSum(int a, int b) {
//        System.out.println("Сумма: " + (a + b));

/// // //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//    int x=5;
//    int y=6;
//System.out.printf("x=%d; y=%d \n", x, y);
/// /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//    В данном случае символы %d обозначают спецификатор, вместо которого подставляет один из аргументов.
//    Спецификаторов и соответствующих им аргументов может быть множество. В данном случае у нас только два аргумента,
//    поэтому вместо первого %d подставляет значение переменной x, а вместо второго - значение переменной y.
//    Сама буква d означает, что данный спецификатор будет использоваться для вывода целочисленных значений.
//    Кроме спецификатора %d мы можем использовать еще ряд спецификаторов для других типов данных:
//              %x: для вывода шестнадцатеричных чисел
//              %f: для вывода чисел с плавающей точкой
//              %e: для вывода чисел в экспоненциальной форме, например, 1.3e+01
//              %c: для вывода одиночного символа
//              %s: для вывода строковых значений
//              %b: для вывода значений типа boolean
/// //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//        for (int i = 1; i < 5; i++){
//            System.out.printf("Квадрат числа %d равен %d %n", i, i * i);
//    }
/// //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//        int[] array = { 1, 2, 3, 4, 5 };
//        for (int i : array){
//
//            System.out.println(i);
//        }
//


